src/cf/Documents/ЗаказКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ЗаказКлиента</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерСтола</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заказ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пожелание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СтатусыЗаказов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/ЗаказКлиента/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает структуру с данными заказа и массивом строк табличной части
// Параметры:
//   Заказ - ДокументСсылка.ЗаказКлиента - ссылка на документ заказа
// Возвращаемое значение:
//   Структура - содержит данные шапки заказа и массив строк табличной части
Функция ДанныеЗаказа(Заказ) Экспорт
	
	ДанныеЗаказа = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗаказовСрезПоследних.Статус КАК Статус,
	|	СтатусыЗаказовСрезПоследних.Заказ КАК Заказ
	|ПОМЕСТИТЬ ВТ_СтатусЗаказа
	|ИЗ
	|	РегистрСведений.СтатусыЗаказов.СрезПоследних(, Заказ = &Ссылка) КАК СтатусыЗаказовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Ссылка КАК Ссылка,
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Дата КАК Дата,
	|	ЗаказКлиента.НомерСтола КАК НомерСтола,
	|	ЗаказКлиента.Комментарий КАК Комментарий,
	|	ЕСТЬNULL(ВТ_СтатусЗаказа.Статус, """") КАК Статус
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусЗаказа КАК ВТ_СтатусЗаказа
	|		ПО (ВТ_СтатусЗаказа.Заказ = ЗаказКлиента.Ссылка)
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиентаЗаказ.Блюдо КАК Блюдо,
	|	ЗаказКлиентаЗаказ.Количество КАК Количество,
	|	ЗаказКлиентаЗаказ.Пожелание КАК Пожелание
	|ИЗ
	|	Документ.ЗаказКлиента.Заказ КАК ЗаказКлиентаЗаказ
	|ГДЕ
	|	ЗаказКлиентаЗаказ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заказ);
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаШапка = Результат[1].Выбрать();
	Если ВыборкаШапка.Следующий() Тогда
		ДанныеЗаказа.Вставить("Ссылка", ВыборкаШапка.Ссылка);
		ДанныеЗаказа.Вставить("Номер", ВыборкаШапка.Номер);
		ДанныеЗаказа.Вставить("Дата", ВыборкаШапка.Дата);
		ДанныеЗаказа.Вставить("НомерСтола", ВыборкаШапка.НомерСтола);
		ДанныеЗаказа.Вставить("Комментарий", ВыборкаШапка.Комментарий);
		ДанныеЗаказа.Вставить("Статус", ВыборкаШапка.Статус);
	КонецЕсли;
	
	Блюда = Новый Массив;
	ВыборкаЗаказ = Результат[2].Выбрать();
	Пока ВыборкаЗаказ.Следующий() Цикл
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("Блюдо", ВыборкаЗаказ.Блюдо);
		ДанныеСтроки.Вставить("Количество", ВыборкаЗаказ.Количество);
		ДанныеСтроки.Вставить("Пожелание", ВыборкаЗаказ.Пожелание);
		Блюда.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	ДанныеЗаказа.Вставить("Блюда", Блюда);
	
	Возврат ДанныеЗаказа;
	
КонецФункции

Функция НайтиПоИдентификатору(ИдентификаторЗаказа) Экспорт
	
	Возврат Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторЗаказа));
	
КонецФункции

#КонецОбласти

#КонецЕсли
